#pragma once

//const std::vector<const char*> ChapSin_Script1 =
//{
//	/* 1  Demon	    */ "고위 기소관 저지먼트",
//
//	/* 15 Script 14 */ "진정한 고통이 시작되기 전에 남길 말이라도 있느냐?",
//	/* 2 MenuBar1 */ "널 먼저 찾지 않은 게 후회스러워.",
//	/* 2 MenuBar2 */ "너에게 형벌을 받을 수 있으니 죄악도 좋은거 같아.",
//
//	/* 15 Script 14 */ "값싼 아부는 집어치워! 일을 어렵게 만들지 마!",
//	/* 2 MenuBar1 */ "그리고 눈이 이렇게 참 예쁘잖아.",
//	/* 2 MenuBar2 */ "좀 전에 헤어스타일이 좋다고 말했었나?",
//
//	/* 15 Script 14 */ "있잖아, 나도 별로 이러고 싶진 않은데. 하지만 이미 계약이\n확정됐어. 네 저주를 막을 수 없다고.",
//	/* 15 Script 14 */ "그래도... 네가 다시 지옥을 휘젓고 다니지만 않는다면 뒤로\n미룰 수는 있겠지",
//	/* 15 Script 14 */ "운명은 이미 정해졌어. 난 너를 죽이고, 넌 시련을 받아야 하지.\n하지만 그게 꼭 오늘일 필요야 없어...",
//	/* 15 Script 14 */ "그러니 운 좋은 줄 알고 내 눈 앞에서 사라져라!",
//	/* 15 Script 14 */ "...",
//	/* 15 Script 14 */ "... ...",
//	/* 15 Script 14 */ "... ... ...",
//	/* 15 Script 14 */ "가도 된다고 했잖아! 썩 사라져!	",
//	/* 15 Script 14 */ "뭐? 네 하렘에 들어오라고? 웃기지 마라!",
//
//	/* 15 Script 14 */ "고문으로 널 죽이려는 고통의 화신과 한 지붕 아래서\n살겠다고?",
//	/* 2 MenuBar1   */ "다른건 바라지도 않아.",
//	/* 2 MenuBar2   */ "내 하렘에 이미 더 나쁜 것도 있어, 정말로.",
//	/* 15 Script 14 */ "뭐, 진심이야?",
//	/* 15 Script 14 */ "이미 제대로 된 의례랑 거리가 먼 마당에, 더 막 나가지 못 할\n것도 없겠어.",
//};
